In [1]:
import pandas as pd
import numpy as np

from scipy.stats import zscore
import scipy.stats as stats

import matplotlib.pyplot as plt
plt.style.use('seaborn')

# Manipulating DataFrames with pandas
https://campus.datacamp.com/courses/manipulating-dataframes-with-pandas/

In [2]:
# Read-in data
sales = pd.read_csv(r'C:\Users\Ol\Documents\DATA ANALYSIS\SALES\sales.csv')

In [4]:
sales.head(2)

  month  eggs  salt  spam
0   Jan    47  12.0    17
1   Feb   110  50.0    31

In [6]:
sales.index = sales.month

In [10]:
sales = sales.drop('month', axis=1)

In [11]:
sales.head(2)

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31

## Indexing

In [12]:
sales['eggs']['Jan']

47

In [14]:
sales.eggs['Jan']

47

* ### Selecting only some cols

In [18]:
sales[['salt', 'eggs']].head(2)    # Note it will affect column's order

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110

In [20]:
sales.loc['Jan', 'salt']

12.0

In [22]:
sales.shape

(6, 3)

## Filtering

In [23]:
# Add some zero values to the dataframe
sales['cheese'] = [0, 6, 0, 5, 6, 2]

In [24]:
sales.sample(2)

       eggs  salt  spam  cheese
month
Jun     205  60.0    55       2
Jan      47  12.0    17       0

* ### Select columns with .all() nonzero values

In [27]:
sales.loc[:, sales.all()].sample(2)

       eggs  salt  spam
month
Apr      77  87.0    20
Mar     221  89.0    72

* ### Select columns with .any() nonzero values

In [28]:
sales.loc[:, sales.any()].sample(2)

       eggs  salt  spam  cheese
month
May     132   NaN    52       6
Jan      47  12.0    17       0

* ### Select columns with .any() NaN values

In [31]:
sales.loc[:, sales.isnull().any()].sample(2)      # This is cooooool!!!!! :))

       salt
month
Mar    89.0
Apr    87.0

* ### Select columns with .all() non-NaN values

In [32]:
sales.loc[:, sales.notnull().all()].sample(2)      # This is cooooool!!!!! :))

       eggs  spam  cheese
month
Mar     221    72       0
Jan      47    17       0

* ### Drop rows with NaNs

In [33]:
sales.dropna(how='any')

       eggs  salt  spam  cheese
month
Jan      47  12.0    17       0
Feb     110  50.0    31       6
Mar     221  89.0    72       0
Apr      77  87.0    20       5
Jun     205  60.0    55       2

## Transforming data

In [36]:
# Vectorized floor division
sales.floordiv(47).head(2)

       eggs  salt  spam  cheese
month
Jan       1   0.0     0       0
Feb       2   1.0     0       0

In [40]:
# Vectorized string methods
sales.index.str.upper()

Index(['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN'], dtype='object', name='month')

* ### Using apply() to transform a column

The .apply() method can be used on a pandas DataFrame to apply an arbitrary Python function to every element. In this exercise you'll take daily weather data in Pittsburgh in 2013 obtained from Weather Underground.

A function to convert degrees Fahrenheit to degrees Celsius has been written for you. Your job is to use the .apply() method to perform this conversion on the 'Mean TemperatureF' and 'Mean Dew PointF' columns of the weather DataFrame.

In [49]:
# Read-in the data
weather = pd.read_csv(r'C:\Users\Ol\Documents\DATA ANALYSIS\pittsburgh2013.csv')

In [42]:
weather.head(2)

,Date,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,Mean Dew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityMiles,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2013-1-1,32,28,21,30,27,16,100,89,77,...,10,6,2,10,8,NaN,0.0,8,Snow,277
1,2013-1-2,25,21,17,14,12,10,77,67,55,...,10,10,10,14,5,NaN,0.0,4,NaN,272

In [43]:
# Write a function to convert degrees Fahrenheit to degrees Celsius: to_celsius
def to_celsius(F):
    return 5/9*(F - 32)

In [44]:
# Apply the function over 'Mean TemperatureF' and 'Mean Dew PointF': df_celsius
df_celsius = weather[['Mean TemperatureF','Mean Dew PointF']].apply(lambda x: to_celsius(x))

In [45]:
# Reassign the columns df_celsius
df_celsius.columns = ['Mean TemperatureC', 'Mean Dew PointC']

In [46]:
df_celsius.head(2)

   Mean TemperatureC  Mean Dew PointC
0          -2.222222        -2.777778
1          -6.111111       -11.111111

* ### Using .map() with a dictionary

The .map() method is used to transform values according to a Python dictionary look-up. In this exercise you'll practice this method while returning to working with the election DataFrame, which has been pre-loaded for you.

Your job is to use a dictionary to map the values 'Obama' and 'Romney' in the 'winner' column to the values 'blue' and 'red', and assign the output to the new column 'color'.

In [48]:
# Read-in the data
election = pd.read_csv(r'C:\Users\Ol\Documents\DATA ANALYSIS\pennsylvania2012_turnout.csv')

In [50]:
election.head(2)

,county,state,total,Obama,Romney,winner,voters,turnout,margin
0,Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
1,Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399

In [51]:
# Create the dictionary: red_vs_blue
red_vs_blue = {'Obama': 'blue', 'Romney': 'red'}

In [52]:
# Use the dictionary to map the 'winner' column to the new column: election['color']
election['color'] = election['winner'].map(red_vs_blue)

In [58]:
election.sample(3)

,county,state,total,Obama,Romney,winner,voters,turnout,margin,color
27,Franklin,PA,62802,30.110506,68.583803,Romney,87406,71.850903,38.473297,red
59,Union,PA,16187,37.455983,60.931612,Romney,23950,67.586639,23.475629,red
44,Monroe,PA,59312,56.364648,42.318586,Obama,108879,54.475151,14.046062,blue

I really like this!!! <3

* ### Using vectorized functions

When performance is paramount, you should avoid using .apply() and .map() because those constructs perform Python for-loops over the data stored in a pandas Series or DataFrame. By using vectorized functions instead, you can loop over the data at the same speed as compiled code (C, Fortran, etc.)! NumPy, SciPy and pandas come with a variety of vectorized functions (called Universal Functions or UFuncs in NumPy).

You can even write your own vectorized functions, but for now we will focus on the ones distributed by NumPy and pandas.

In this exercise you're going to import the **zscore** method from **scipy.stats** and use it to compute the deviation in voter turnout in Pennsylvania from the mean in fractions of the standard deviation. In statistics, the z-score is the number of standard deviations by which an observation is above the mean - so if it is negative, it means the observation is below the mean.

Instead of using .apply() as you did in the earlier exercises, the zscore UFunc will take a pandas Series as input and return a NumPy array. You will then assign the values of the NumPy array to a new column in the DataFrame. You will be working with the election DataFrame - it has been pre-loaded for you.

In [60]:
# Call zscore with election['turnout'] as input: turnout_zscore
turnout_zscore = zscore(election['turnout'])

In [61]:
# Print the type of turnout_zscore
print(type(turnout_zscore))

<class 'numpy.ndarray'>

In [62]:
# Assign turnout_zscore to a new column: election['turnout_zscore']
election['turnout_zscore'] = turnout_zscore

In [63]:
election.head(2)

,county,state,total,Obama,Romney,winner,voters,turnout,margin,color,turnout_zscore
0,Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667,red,0.853734
1,Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399,blue,0.439846

### Having fun with indexes

In [65]:
# Rename index column
election.index.name = 'INDEX'

In [66]:
election.head(1)

,county,state,total,Obama,Romney,winner,voters,turnout,margin,color,turnout_zscore
INDEX,,,,,,,,,,,
0,Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667,red,0.853734

In [67]:
# Rename columns row
election.columns.name = 'VARIABLES'

In [68]:
election.head(1)

VARIABLES,county,state,total,Obama,Romney,winner,voters,turnout,margin,color,turnout_zscore
INDEX,,,,,,,,,,,
0,Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667,red,0.853734

### Hierarchical index

In [178]:
election.set_index(['state', 'county']).sort_index().sample(5)

VARIABLES              total      Obama     Romney  winner  voters    turnout  \
state county
PA    Lancaster       219677  39.652763  58.888277  Romney  314567  69.834725
      Union            16187  37.455983  60.931612  Romney   23950  67.586639
      Juniata           9480  26.719409  71.951477  Romney   13547  69.978593
      Northumberland   31512  39.324702  58.758568  Romney   54978  57.317472
      Huntingdon       17587  30.607835  67.964974  Romney   28824  61.015126

VARIABLES                margin color  turnout_zscore
state county
PA    Lancaster       19.235514   red        1.086751
      Union           23.475629   red        0.650961
      Juniata         45.232068   red        1.114639
      Northumberland  19.433866   red       -1.339710
      Huntingdon      37.357139   red       -0.622923

## Pivoting

* ### Pivoting a single variable

Suppose you started a blog for a band, and you would like to log how many visitors you have had, and how many signed-up for your newsletter. To help design the tours later, you track where the visitors are. A DataFrame called users consisting of this information has been pre-loaded for you.

Inspect users in the IPython Shell and make a note of which variable you want to use to index the rows ('weekday'), which variable you want to use to index the columns ('city'), and which variable will populate the values in the cells ('visitors'). Try to visualize what the result should be.

In [3]:
users = pd.read_csv(r'C:\Users\Ol\Documents\DATA ANALYSIS\users.csv')

In [4]:
users.head(2)

   Unnamed: 0 weekday    city  visitors  signups
0           0     Sun  Austin       139        7
1           1     Sun  Dallas       237       12

In [5]:
# Drop unused cols
users = users.drop('Unnamed: 0', axis=1)

In [6]:
users.sample(2)

  weekday    city  visitors  signups
1     Sun  Dallas       237       12
2     Mon  Austin       326        3

In [7]:
# Pivot the users DataFrame: visitors_pivot
visitors_pivot = users.pivot(index='weekday', columns='city', values='visitors')

In [8]:
visitors_pivot

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

* ### Pivoting all variables

If you do not select any particular variables, all of them will be pivoted. In this case - with the users DataFrame - both 'visitors' and 'signups' will be pivoted, creating hierarchical column labels.

You will explore this for yourself now in this exercise.

In [9]:
# Pivot users with signups indexed by weekday and city: signups_pivot
signups_pivot = users.pivot(index='weekday', columns='city', values='signups')

# Print signups_pivot
signups_pivot.head()

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

In [10]:
# Pivot users pivoted by both signups and visitors: pivot
pivot_ = users.pivot(index='weekday', columns='city')

# Print the pivoted DataFrame
pivot_.head()

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

## Grouping with .groupby()

In [20]:
users

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

### Using aggregation functions with .groupby()

In [25]:
# Groupby and add aggregate function
users.groupby('weekday').sum()

         visitors  signups
weekday
Mon           782        8
Sun           376       19

In [26]:
users.groupby('weekday').mean()

         visitors  signups
weekday
Mon         391.0      4.0
Sun         188.0      9.5

In [27]:
users.groupby('weekday').min()

           city  visitors  signups
weekday
Mon      Austin       326        3
Sun      Austin       139        7

### Grouping using multiple indexes

In [38]:
# Create a bigger dataframe
usersusers = pd.concat([users, users])
# Reindex it
usersusers.index = np.arange(len(usersusers))

In [44]:
# Add some noise to columns
usersusers.visitors = usersusers.visitors + np.random.randint(0, 100, len(usersusers))
usersusers.signups = usersusers.signups + np.random.randint(0, 10, len(usersusers))

In [46]:
usersusers.sample(3)

  weekday    city  visitors  signups
7     Mon  Dallas       536       11
6     Mon  Austin       331        4
4     Sun  Austin       229        7

In [50]:
# Groupby muliindex
usersusers.groupby(['weekday', 'city']).mean()

                visitors  signups
weekday city
Mon     Austin     363.5      6.5
        Dallas     502.5     12.5
Sun     Austin     229.0      7.0
        Dallas     256.0     18.0

* ### Groupby another dataframe 

It's possible **iff** both dataframes have the **same indexes**.

In [75]:
# Create dataframes
regions = {'Region': ['Europe', 'Europe', 'Asia', 'Africa', 'Africa'], \
           'Country': ['Poland','Germany', 'China', 'Chad', 'Ghana']}

df_regions = pd.DataFrame(regions, columns=['Country', 'Region'])

indicator = {'Country': ['Poland','Germany', 'China', 'Chad', 'Ghana'], \
            'Indicator': [61, 67, 300, 47, 57]}

df_indicator = pd.DataFrame(indicator, columns=['Country', 'Indicator'])

In [78]:
# Set indexes
df_regions = df_regions.set_index('Country')
df_indicator = df_indicator.set_index('Country')

In [80]:
df_indicator.sample(2)

         Indicator
Country
China          300
Chad            47

In [84]:
# Group indicator by region
df_indicator.groupby(df_regions.Region).sum()

        Indicator
Region
Africa        104
Asia          300
Europe        128

### Multiple aggregations using .agg()

In [85]:
df_indicator.groupby(df_regions.Region).agg(['max', 'sum', 'mean'])

       Indicator
             max  sum mean
Region
Africa        57  104   52
Asia         300  300  300
Europe        67  128   64

In [86]:
# Use a custom function with .agg()
def col_range(series):
    return series.max() - series.min()

In [91]:
df_indicator.groupby(df_regions.Region).agg([col_range, 'mean', 'std'])

       Indicator
       col_range mean       std
Region
Africa        10   52  7.071068
Asia           0  300       NaN
Europe         6   64  4.242641

## Transforming the data

In [96]:
df_indicator.groupby(df_regions.Region)['Indicator'].transform(zscore)

C:\ProgramData\Anaconda3\lib\site-packages\scipy\stats\stats.py:2248: RuntimeWarning: invalid value encountered in true_divide
  return (a - mns) / sstd

Country
Poland    -1.0
Germany    1.0
China      NaN
Chad      -1.0
Ghana      1.0
Name: Indicator, dtype: float64

* ### Detecting outliers with Z-Scores

As Dhavide demonstrated in the video using the zscore function, you can apply a .transform() method after grouping to apply a function to groups of data independently. The z-score is also useful to find outliers: a z-score value of +/- 3 is generally considered to be an outlier.

In this example, you're going to normalize the Gapminder data in 2010 for life expectancy and fertility by the z-score per region. Using boolean indexing, you will filter out countries that have high fertility rates and low life expectancy for their region.

The Gapminder DataFrame for 2010 indexed by 'Country' is provided for you as gapminder_2010.

In [101]:
# Read in the data
gapm = pd.read_csv(r'C:\Users\Ol\Documents\DATA ANALYSIS\gapminder_tidy.csv')

In [100]:
gapm.head(2)

,Country,Year,fertility,life,population,child_mortality,gdp,region
0,Afghanistan,1964,7.671,33.639,10474903.0,339.7,1182.0,South Asia
1,Afghanistan,1965,7.671,34.152,10697983.0,334.1,1182.0,South Asia

In [102]:
# Slice the dataframe (2010)
gapminder_2010 = gapm[gapm.Year == 2010]

In [109]:
# Group gapminder_2010: standardized
standardized = gapminder_2010.groupby('region')['life', 'fertility'].transform(zscore)

In [110]:
# Construct a Boolean Series to identify outliers: outliers
outliers = (standardized['life'] < -3) | (standardized['fertility'] > 3)

In [111]:
# Filter gapminder_2010 by the outliers: gm_outliers
gm_outliers = gapminder_2010.loc[outliers]

In [112]:
# Print gm_outliers
gm_outliers

,Country,Year,fertility,life,population,child_mortality,gdp,region
3646,Guatemala,2010,3.974,71.100,14388929.0,34.5,6849.0,America
3846,Haiti,2010,3.350,45.000,9993247.0,208.8,1518.0,America
8846,Tajikistan,2010,3.780,66.830,6878637.0,52.6,2110.0,Europe & Central Asia
8996,Timor-Leste,2010,6.237,65.952,1124355.0,63.8,1777.0,East Asia & Pacific

* ### Filling missing data (imputation) by group

Many statistical and machine learning packages cannot determine the best action to take when missing data entries are encountered. Dealing with missing data is natural in pandas (both in using the default behavior and in defining a custom behavior). In Chapter 1, you practiced using the .dropna() method to drop missing values. Now, you will practice imputing missing values. You can use .groupby() and .transform() to fill missing data appropriately for each group.

Your job is to fill in missing 'age' values for passengers on the Titanic with the median age from their 'gender' and 'pclass'. To do this, you'll group by the 'sex' and 'pclass' columns and transform each group with a custom function to call .fillna() and impute the median value.

The DataFrame has been pre-loaded as titanic. Explore it in the IPython Shell by printing the output of titanic.tail(10). Notice in particular the NaNs in the 'age' column.

In [134]:
# Read in the data
titanic = pd.read_csv(r'C:\Users\Ol\Documents\DATA ANALYSIS\titanic.csv')

In [140]:
titanic.age.isnull().sum()

263

In [142]:
titanic.tail(4)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [143]:
# Create a groupby object: by_sex_class
by_sex_class = titanic.groupby(['sex', 'pclass'])

In [144]:
# Write a function that imputes median
def impute_median(series):
    return series.fillna(series.median())

In [145]:
# Impute age and assign to titanic['age']
titanic.age = by_sex_class['age'].transform(impute_median)

In [146]:
titanic.tail(4)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1305,3,0,"Zabour, Miss. Thamine",female,22.0,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

* ### Other transformations with .apply

The .apply() method when used on a groupby object performs an arbitrary function on each of the groups. These functions can be aggregations, transformations or more complex workflows. The .apply() method will then combine the results in an intelligent way.

In this exercise, you're going to analyze economic disparity within regions of the world using the Gapminder data set for 2010. To do this you'll define a function to compute the aggregate spread of per capita GDP in each region and the individual country's z-score of the regional per capita GDP. You'll then select three countries - United States, Great Britain and China - to see a summary of the regional GDP and that country's z-score against the regional mean.

In [148]:
# Define disparity function

def disparity(gr):
    # Compute the spread of gr['gdp']: s
    s = gr['gdp'].max() - gr['gdp'].min()
    # Compute the z-score of gr['gdp'] as (gr['gdp']-gr['gdp'].mean())/gr['gdp'].std(): z
    z = (gr['gdp'] - gr['gdp'].mean())/gr['gdp'].std()
    # Return a DataFrame with the inputs {'z(gdp)':z, 'regional spread(gdp)':s}
    return pd.DataFrame({'z(gdp)':z , 'regional spread(gdp)':s})

In [159]:
# Reindex the frame (set 'Country' as index)
gapminder_2010i = gapminder_2010.set_index('Country')

In [160]:
# Group gapminder_2010 by 'region': regional
regional = gapminder_2010i.groupby('region')

In [161]:
# Apply the disparity function on regional: reg_disp
reg_disp = regional.apply(disparity)

In [162]:
# Print the disparity of 'United States', 'United Kingdom', and 'China'
reg_disp.loc[['United States','United Kingdom','China'], :]

                regional spread(gdp)    z(gdp)
Country
United States                47855.0  3.013374
United Kingdom               89037.0  0.572873
China                        96993.0 -0.432756

* ### Grouping and filtering with .apply()

By using .apply(), you can write functions that filter rows within groups. The .apply() method will handle the iteration over individual groups and then re-combine them back into a Series or DataFrame.

In this exercise you'll take the Titanic data set and analyze survival rates from the 'C' deck, which contained the most passengers. To do this you'll group the dataset by 'sex' and then use the .apply() method on a provided user defined function which calculates the mean survival rates on the 'C' deck:

In [165]:
def c_deck_survival(gr):
    c_passengers = gr['cabin'].str.startswith('C').fillna(False)
    return gr.loc[c_passengers, 'survived'].mean()

In [166]:
# Create a groupby object using titanic over the 'sex' column: by_sex
by_sex = titanic.groupby('sex')

In [167]:
# Call by_sex.apply with the function c_deck_survival and print the result
c_surv_by_sex = by_sex.apply(c_deck_survival)

In [168]:
# Print the survival rates
print(c_surv_by_sex)

sex
female    0.913043
male      0.312500
dtype: float64

* ### Grouping and filtering with .filter()

You can use groupby with the .filter() method to remove whole groups of rows from a DataFrame based on a boolean condition.

In this exercise, you'll take the February sales data and remove entries from companies that purchased less than 35 Units in the whole month.

First, you'll identify how many units each company bought for verification. Next you'll use the .filter() method after grouping by 'Company' to remove all rows belonging to companies whose sum over the 'Units' column was less than 35. Finally, verify that the three companies whose total Units purchased were less than 35 have been filtered out from the DataFrame.

In [189]:
# Read in data
sales_feb = pd.read_csv(r'C:\Users\Ol\Documents\DATA ANALYSIS\SALES\sales-feb-2015.csv',
                       index_col='Date', parse_dates=True)

In [190]:
sales_feb.head(2)

                       Company   Product  Units
Date
2015-02-02 08:30:00      Hooli  Software      3
2015-02-02 21:00:00  Mediacore  Hardware      9

In [192]:
# Group sales by 'Company': by_company
by_company = sales_feb.groupby('Company')

In [193]:
# Compute the sum of the 'Units' of by_company: by_com_sum
by_com_sum = by_company.Units.sum()
print(by_com_sum)

Company
Acme Coporation    34
Hooli              30
Initech            30
Mediacore          45
Streeplex          36
Name: Units, dtype: int64

In [196]:
# Filter 'Units' where the sum is > 35: by_com_filt
by_com_filt = by_company.filter(lambda g: g['Units'].sum() > 35)
by_com_filt.sample(2)

                       Company   Product  Units
Date
2015-02-09 09:00:00  Streeplex   Service     19
2015-02-21 05:00:00  Mediacore  Software      3

* ### Filtering and grouping with .map()

You have seen how to group by a column, or by multiple columns. Sometimes, you may instead want to group by a function/transformation of a column. The key here is that the Series is indexed the same way as the DataFrame. You can also mix and match column grouping with Series grouping.

In this exercise your job is to investigate survival rates of passengers on the Titanic by 'age' and 'pclass'. In particular, the goal is to find out what fraction of children under 10 survived in each 'pclass'. You'll do this by first creating a boolean array where True is passengers under 10 years old and False is passengers over 10. You'll use .map() to change these values to strings.

Finally, you'll group by the under 10 series and the 'pclass' column and aggregate the 'survived' column. The 'survived' column has the value 1 if the passenger survived and 0 otherwise. The mean of the 'survived' column is the fraction of passengers who lived.

The DataFrame has been pre-loaded for you as titanic.

In [197]:
# Create the Boolean Series: under10
under10 = (titanic.age < 10).map({True:'under 10', False:'over 10'})

In [198]:
# Group by under10 and compute the survival rate
survived_mean_1 = titanic.survived.groupby(under10).mean()
print(survived_mean_1)

age
over 10     0.366748
under 10    0.609756
Name: survived, dtype: float64

In [199]:
# Group by under10 and pclass and compute the survival rate
survived_mean_2 = titanic.groupby([under10, 'pclass'])['survived'].mean()
print(survived_mean_2)

age       pclass
over 10   1         0.617555
          2         0.380392
          3         0.238897
under 10  1         0.750000
          2         1.000000
          3         0.446429
Name: survived, dtype: float64

## Case Study: Olimpic Games

In [2]:
# Read in the data
medals = pd.read_csv(r'C:\Users\Ol\Documents\DATA ANALYSIS\all_medalists.csv', sep=',')

In [3]:
medals[(medals.NOC == 'POL')].groupby(['Gender', 'Medal'])['Medal'].count()

Gender  Medal
Men     Bronze    165
        Gold       90
        Silver    151
Women   Bronze     58
        Gold       13
        Silver     22
Name: Medal, dtype: int64

* ### Using .value_counts() for ranking

For this exercise, you will use the pandas Series method .value_counts() to determine the top 15 countries ranked by total number of medals.

Notice that .value_counts() sorts by values by default. The result is returned as a Series of counts indexed by unique entries from the original Series with values (counts) ranked in descending order.

In [4]:
# Select the 'NOC' column of medals: country_names
country_names = medals.NOC

In [5]:
# Count the number of medals won by each country: medal_counts
medal_counts = country_names.value_counts()

In [6]:
# Print top 15 countries ranked by medals
medal_counts.head(5)

USA    4335
URS    2049
GBR    1594
FRA    1314
ITA    1228
Name: NOC, dtype: int64

* ### Using .pivot_table() to count medals by type

Rather than ranking countries by total medals won and showing that list, you may want to see a bit more detail. You can use a pivot table to compute how many separate bronze, silver and gold medals each country won. That pivot table can then be used to repeat the previous computation to rank by total medals won.

In this exercise, you will use .pivot_table() first to aggregate the total medals by type. Then, you can use .sum() along the columns of the pivot table to produce a new column. When the modified pivot table is sorted by the total medals column, you can display the results from the last exercise with a bit more detail.

In [7]:
# Construct the pivot table: counted
counted = medals.pivot_table(index='NOC', columns='Medal', values='Athlete', aggfunc='count')

In [8]:
# Create the new column: counted['totals']
counted['totals'] = counted.sum(axis=1)

In [9]:
# Sort counted by the 'totals' column
counted = counted.sort_values('totals', ascending=False)

In [10]:
# Print the top 15 rows of counted
counted.head(5)

Medal  Bronze    Gold  Silver  totals
NOC
USA    1052.0  2088.0  1195.0  4335.0
URS     584.0   838.0   627.0  2049.0
GBR     505.0   498.0   591.0  1594.0
FRA     475.0   378.0   461.0  1314.0
ITA     374.0   460.0   394.0  1228.0

* ### Some exploration

In [11]:
medals['Event_gender'].value_counts()

M    20067
W     7278
X     1871
Name: Event_gender, dtype: int64

In [12]:
medals.Gender.value_counts()

Men      21721
Women     7495
Name: Gender, dtype: int64

In [13]:
for i, row in medals.iterrows():
    if (row.Gender[0] != row.Event_gender) and row.Event_gender != 'X':
        print('{:04}. {}: {}'.format(i, row.Gender, row.Event_gender))

23675. Men: W

In [14]:
medals.iloc[23675, :]

City                       Sydney
Edition                      2000
Sport                   Athletics
Discipline              Athletics
Athlete         CHEPCHUMBA, Joyce
NOC                           KEN
Gender                        Men
Event                    marathon
Event_gender                    W
Medal                      Bronze
Name: 23675, dtype: object

* ### Applying .drop_duplicates()

What could be the difference between the 'Event_gender' and 'Gender' columns? You should be able to evaluate your guess by looking at the unique values of the pairs (Event_gender, Gender) in the data. In particular, you should not see something like (Event_gender='M', Gender='Women'). However, you will see that, strangely enough, there is an observation with (Event_gender='W', Gender='Men').

The duplicates can be dropped using the .drop_duplicates() method, leaving behind the unique observations. The DataFrame has been loaded as medals.

In [15]:
# Select columns: ev_gen
ev_gen = medals[['Event_gender', 'Gender']]

In [16]:
# Drop duplicate pairs: ev_gen_uniques
ev_gen_uniques = ev_gen.drop_duplicates()

In [17]:
# Print ev_gen_uniques
ev_gen_uniques

      Event_gender Gender
0                M    Men
348              X    Men
416              W  Women
639              X  Women
23675            W    Men

* ### Finding possible errors with .groupby()

You will now use .groupby() to continue your exploration. Your job is to group by 'Event_gender' and 'Gender' and count the rows.

You will see that there is only one suspicious row: This is likely a data error.

The DataFrame is available to you as medals.

In [18]:
# Group medals by the two columns: medals_by_gender
medals_by_gender = medals.groupby(['Event_gender', 'Gender'])

In [19]:
# Create a DataFrame with a group count: medal_count_by_gender
medal_count_by_gender = medals_by_gender.count()

In [20]:
# Print medal_count_by_gender
medal_count_by_gender['Medal']

Event_gender  Gender
M             Men       20067
W             Men           1
              Women      7277
X             Men        1653
              Women       218
Name: Medal, dtype: int64

* ### Locating suspicious data

You will now inspect the suspect record by locating the offending row.

You will see that, according to the data, Joyce Chepchumba was a man that won a medal in a women's event. That is a data error as you can confirm with a web search.

In [21]:
# Create the Boolean Series: sus
sus = (medals.Event_gender == 'W') & (medals.Gender == 'Men')

In [22]:
# Create a DataFrame with the suspicious row: suspect
suspect = medals[sus]

In [23]:
# Print suspect
suspect

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
23675,Sydney,2000,Athletics,Athletics,"CHEPCHUMBA, Joyce",KEN,Men,marathon,W,Bronze

* ### Using .nunique() to rank by distinct sports

You may want to know which countries won medals in the most distinct sports. The .nunique() method is the principal aggregation here. Given a categorical Series S, S.nunique() returns the number of distinct categories.

* ```.nunique()``` returns a number of unique values in Series

In [25]:
# Group medals by 'NOC': country_grouped
country_grouped = medals.groupby('NOC')

# Compute the number of distinct sports in which each country won medals: Nsports
Nsports = country_grouped['Sport'].nunique()

# Sort the values of Nsports in descending order
Nsports = Nsports.sort_values(ascending=False)

# Print the top 15 rows of Nsports
Nsports.head(5)

NOC
USA    34
GBR    31
FRA    28
GER    26
CHN    24
Name: Sport, dtype: int64

* ### Counting USA vs. USSR Cold War Olympic Sports

The Olympic competitions between 1952 and 1988 took place during the height of the Cold War between the United States of America (USA) & the Union of Soviet Socialist Republics (USSR). Your goal in this exercise is to aggregate the number of distinct sports in which the USA and the USSR won medals during the Cold War years.

The construction is mostly the same as in the preceding exercise. There is an additional filtering stage beforehand in which you reduce the original DataFrame medals by extracting data from the Cold War period that applies only to the US or to the USSR. The relevant country codes in the DataFrame, which has been pre-loaded as medals, are 'USA' & 'URS'.

In [27]:
# Extract all rows for which the 'Edition' is between 1952 & 1988: during_cold_war
during_cold_war = (medals.Edition >= 1952) & (medals.Edition <= 1988)

# Extract rows for which 'NOC' is either 'USA' or 'URS': is_usa_urs
is_usa_urs = medals.NOC.isin(['USA', 'URS'])

# Use during_cold_war and is_usa_urs to create the DataFrame: cold_war_medals
cold_war_medals = medals.loc[during_cold_war & is_usa_urs]

# Group cold_war_medals by 'NOC'
country_grouped = cold_war_medals.groupby('NOC')

# Create Nsports
Nsports = country_grouped['Sport'].nunique().sort_values(ascending=False)

# Print Nsports
print(Nsports)

NOC
URS    21
USA    20
Name: Sport, dtype: int64

* ### Counting USA vs. USSR Cold War Olympic Medals

For this exercise, you want to see which country, the USA or the USSR, won the most medals consistently over the Cold War period.

There are several steps involved in carrying out this computation.

   * You'll need a pivot table with years ('Edition') on the index and countries ('NOC') on the columns. The entries will be the total number of medals each country won that year. If the country won no medals in a given edition, expect a NaN in that entry of the pivot table.
   * You'll need to slice the Cold War period and subset the 'USA' and 'URS' columns.
   * You'll need to make a Series from this slice of the pivot table that tells which country won the most medals in that edition using .idxmax(axis='columns'). If .max() returns the maximum value of Series or 1D array, .idxmax() returns the index of the maximizing element. The argument axis=columns or axis=1 is required because, by default, this aggregation would be done along columns for a DataFrame.
   * The final Series contains either 'USA' or 'URS' according to which country won the most medals in each Olympic edition. You can use .value_counts() to count the number of occurrences of each.

In [28]:
# Create the pivot table: medals_won_by_country
medals_won_by_country = medals.pivot_table(index='Edition', columns='NOC', values='Athlete', aggfunc='count')

# Slice medals_won_by_country: cold_war_usa_usr_medals
cold_war_usa_usr_medals = medals_won_by_country.loc[1952:1988, ['USA','URS']]

# Create most_medals
most_medals = cold_war_usa_usr_medals.idxmax(axis='columns')

# Print most_medals.value_counts()
print(most_medals.value_counts())

URS    8
USA    2
dtype: int64